window.DRAGON_TYPE_DB = {
  체력형: [
    //땅
      "패트",
      "타이거",
      "램곤",
      "헝그리",
      "머드",
      { name: "오렌지리프", aliases: ["오맆"] },
      "지진",
      { name: "포이즌리버", aliases: ["포리"] },
      "포폰",
      { name: "애플칙", aliases: ["앺칙"] },
      { name: "알데바란", aliases: ["알데"] },
      "에그마용",


    //물
      "네시",
      "스왐프",
      "툰드라",
      "유르카",
      "알레샤",
      { name: "크로마 알레샤", aliases: ["크레샤"] },
      "볼바",


    //불
      "붐버",
      "포포모",
      { name: "염화룡", aliases: ["염화"] },
      "파이거",
      { name: "크로마 파이거", aliases: ["크파거", "크파이거"] },


    //바람
      "윈드",
      { name: "식스 레그 혼", aliases: ["식레혼"] },
      "뮤직",
      "가디언",
      "토템",
      "클라우드",
      "핑크벨",
      { name: "엠파이어", aliases: ["엠파"] },
      "혼",


    //빛
      "카멜레용",
      "레인보우",
      "샴",
      "삐에로",
      "시타엘",
      { name: "엔젤주니어", aliases: ["엔주"] },


    //어둠
      "프랑켄",
      { name: "블랙티어", aliases: ["블티"] },
      "원더",
      { name: "블랙찡또", aliases: ["블찡"] },
      { name: "문라이트", aliases: ["문라"] },
      "말로단",
      { name: "마그나스", aliases: ["마그"] },
      { name: "카스룩스", aliases: ["카룩"] },


    //여명
      "베리스",
      { name: "아말테아", aliases: ["아말"] },
      "야누스",


    //황혼
      { name: "이클립스", aliases: ["이클"] },
      { name: "템피오스", aliases: ["템피"] },
      { name: "흐레스벨그", aliases: ["흐벨"] },


    //악몽
      { name: "단탈리온", aliases: ["단탈"] },
      "네무스",
      "블라드"

  ],


  공격형: [
    //땅
      "파워",
      { name: "데빌곤", aliases: ["데빌"] },
      "베가본드",
      { name: "레오벡터", aliases: ["레벡"] },
      "바스카",


    //물
      { name: "빙하고룡", aliases: ["빙고"] },
      "페어리",
      { name: "샤크곤", aliases: ["샼곤"] },
      { name: "메갈로돈", aliases: ["메갈"] },
      { name: "블리자드", aliases: ["블자"] },
      { name: "베른하르트", aliases: ["베른"] },
      "루드라",
      { name: "피싱테일", aliases: ["피싱", "피테"] },
      { name: "루미네스", aliases: ["루미", "룸네"] },


    //불
      "파이어",
      "피닉스",
      { name: "레드와이번", aliases: ["레와"] },
      "말소자",
      "수라",
      { name: "엔투라스", aliases: ["엔투"] },
      "라센티",
      "배틀",
      "번네스",
      "데모니오",


    //바람
      "청룡",
      "페이퍼",
      { name: "스트라이커", aliases: ["스커"] },
      "아스티",
      "아라카",
      "거스트",
      { name: "블루썬더", aliases: ["블썬"] },
      { name: "크로마 블루썬더", aliases: ["크블썬"] },


    //빛
      "큐피트",
      "모리카",
      { name: "오르도", aliases: ["올도"] },
      "솔라",
      "카루라",
      "아톤",
      "스워드",
      "바르그",
      "야즈니르",
      "아르고",


    //어둠
      "블레이드",
      "서펀트",
      { name: "G네", aliases: ["지네"] },
      "유니",
      { name: "다크프로스티", aliases: ["닼프"] },
      "쉐도우",
      "닌자",
      { name: "블랙퀸", aliases: ["블퀸"] },
      { name: "스플렌더", aliases: ["스플"] },
      { name: "타임머신", aliases: ["탐머"] },
      { name: "아자크", aliases: ["아잨"] },
      "베타라",
      { name: "크로마 베타라", aliases: ["크베타"] },
      "오벡스",


    //여명
      "합라",
      "셀마사",
      "울르",


    //황혼
      "카라선",
      { name: "렉스톤", aliases: ["렉톤"] },
      "틸키",
      "하리카",


    //악몽
      { name: "디멘션", aliases: ["디멘"] },
      "쉴로시",
      { name: "잠식된 요르문간드", aliases: ["잠식","잠간","잠간드"] },
      "레무레스"

  ],


  방어형: [
    //땅
      "바위",
      { name: "지하땅굴", aliases: ["지땅"] },
      "에그",
      "리프",
      "스마트",
      "타투",
      "팀버",
      "플라워",
      "파키",


    //물
      "프로그",
      "현무",
      "루피아",
      "스터드",
      { name: "위드미", aliases: ["윋미"] },
      { name: "폴투누스", aliases: ["폴투"] },
      "스카트",
      "로키",


    //불
      "스파이크",
      { name: "너티빌런", aliases: ["너빌"] },
      "와일드",
      "루가르",
      "토트",
      "스카투스",
      { name: "크로마 스카투스", aliases: ["크스카"] },
      "아이언",


    //바람
      { name: "프로스티", aliases: ["프티"] },
      "해태",
      "스틸윙",
      "키갈",
      "리티오",
      { name: "크로마 리티오", aliases: ["크티오"] },


    //빛
      "나이트",
      "순둥곤",
      "사나래",
      "로루스",
      "헤이즈",
      "개틀링곤",
      { name: "솔루카니스", aliases: ["솔카"] },
      { name: "프로텍트", aliases: ["프텍"] },
      { name: "크로마 프로텍트", aliases: ["크프텍"] },
      "크리마용",


    //어둠
      "베네지",
      "투탕카",
      { name: "블랙아머", aliases: ["블암"] },
      "쿠로이",
      "카르나",
      "쿠베라",
      "포르타",


    //여명
      { name: "엘리고스", aliases: ["엘고"] },
      "라스",
      "조화룡",


    //황혼
      { name: "데스락", aliases: ["데락"] },
      "세에레",
      "차차웅",


    //악몽
      { name: "벨레드", aliases: ["벨렏"] },
      { name: "미스핏", aliases: ["미핏"] },
      { name: "크로마 벨레드", aliases: ["크벨"] }

  ],


  체공형: [
    //땅
      "히드라곤",
      "콜로서스",
      "레이어스",
      "리베티",
      "케찰코아틀",


    //물
      { name: "블루라이트닝", aliases: ["블라"] },
      "바이올렛",
      "해마곤",
      "베놈",
      { name: "브리트라", aliases: ["브트"] },
      "프로즌",
      "루살카",


    //불
      { name: "번개고룡", aliases: ["번고"] },
      "라바",
      "본헤드",
      "플레임",
      "레드불",
      "므네이아",
      "블레이즈",
      "적마룡",
      "자룡",


    //바람
      "제트",
      "스왈로우",
      "카오스",
      "제피로스",
      "보레아스",


    //빛
      "라이곤",
      "캥거레빗",
      "네온",
      { name: "슈팅스타", aliases: ["슈스"] },
      "깨비곤",
      "미나스",
      "알투스",
      "메라크",
      "스파이시",


    //어둠
      "흑룡",
      "메탈",
      { name: "미이라곤", aliases: ["미라"] },
      "스켈레곤",
      { name: "다크닉스", aliases: ["다닉"] },
      "히에나곤",
      { name: "크레센트", aliases: ["크센"] },
      "윗치",
      "캣츠곤",
      "타르타로스",
      "다크폴",
      "피데스",
      { name: "요르문간드", aliases: ["욜문"] },
      "티아매트",
      "바알",
      "시그마",


    //여명
      { name: "할리벨", aliases: ["할벨"] },
      "타아비레",
      "보상이용",
      { name: "루크바트", aliases: ["뤀바"] },
      "프레이야",


    //황혼
      { name: "렉몰 리버스", aliases: ["렉리"] },
      "네뷸라",
      "인베르소",
      "레긴레이프",
      { name: "크로마 레긴레이프", aliases: ["크레긴"] },


    //악몽
      "움브라",
      "루드오어",
      { name: "크레바스", aliases: ["크바"] },
      { name: "발레포르", aliases: ["발포"] },
      { name: "크로마 발레포르", aliases: ["크발포", "크발레", "크발"] }

  ],


  체방형: [
    //땅
      "골든혼",
      { name: "머스타드해머", aliases: ["머햄", "해머"] },
      "칸타카",
      { name: "아스타테", aliases: ["앗타테"] },
      { name: "헤임달", aliases: ["헴달"] },
      "논",
      "파이썬",
      "헤라클레스",


    //물
      "테일",
      "수룡",
      "슬라임",
      "퍼플립스",
      "마리노",
      "나트론",
      "레굴루스",
      { name: "크로마 레굴루스", aliases: ["크레굴"] },


    //불
      "금오",
      "푸투룸",
      { name: "이그나", aliases: ["익나"] },
      "화귀",
      "타나토스",


    //바람
      "레이디",
      "타이푼",
      "태엽",
      "센투라",
      "티르",
      "루루",
      { name: "크로마 루루", aliases: ["크루루"] },


    //빛
      { name: "고대신룡", aliases: ["고신"] },
      "엔젤",
      "에메랄드",
      "치킨헤드",
      "골드",
      "백룡",
      "오로라",
      "아실리",
      { name: "스타에이스", aliases: ["스에"] },
      "테디",
      "베르나",
      "라파엘",


    //어둠
      "드라고노이드",
      { name: "유니버스", aliases: ["유버"] },
      "베히모스",
      { name: "다크나이트", aliases: ["닼나"] },
      "고트",


    //여명
      "미미르",
      "네비아",
      "아프로디테",


    //황혼
      "발라크",
      "에피트",
      "마누스",


    //악몽
      { name: "애니마라", aliases: ["애마"] },
      "롱기누스",
      "마스테마"

  ],


  공방형: [
    //땅
      "스파인",
      "스콜피온",
      "다로스",
      "즈믄",
      "아카이아",
      { name: "크로마 아카이아", aliases: ["크아카"] },


    //물
      "미니",
      "아쿠아",
      { name: "아이스 드레이크", aliases: ["아드"] },
      "세크레타",
      { name: "트로페우스", aliases: ["트페"] },
      "마소티스",
      "옥타",
      { name: "크로마 옥타", aliases: ["크옥타"] },


    //불
      "헬",
      "인섹트",
      "샌드",
      "볼케이노",
      "이그니스",
      "가루다",
      "마룡",
      "불나래",
      { name: "크로마 불나래", aliases: ["크불", "크나래"] },


    //바람
      "에일리언",
      "윙스",
      { name: "메탈 마그넷", aliases: ["메마"] },
      { name: "i곤", aliases: ["아이곤"] },
      "피스",
      { name: "그레이탄", aliases: ["그탄"] },
      { name: "레인보우배트곤", aliases: ["레뱉", "레뱉곤", "뱉곤"] },
      { name: "에트왈", aliases: ["엩왈"] },
      "피타야",
      "토르",
      "오로",


    //빛
      { name: "고대 주니어", aliases: ["고주"] },
      "파라오곤",
      "바르라아",
      { name: "아르테미스", aliases: ["알테"] },
      { name: "화이트썬더", aliases: ["화썬"] },
      "탈릿사",
      "아만타",
      "샤흐",


    //어둠
      { name: "뱃도치", aliases: ["벳도치"] },
      "코브라곤",
      { name: "마르바스", aliases: ["말바"] },
      "스케어",
      { name: "드래곤 슬레이어", aliases: ["드슬"] },
      "마카라",
      "리치몬드",
      { name: "크로마 리치몬드", aliases: ["크리치"] },
      "하트샤",
      "데몽과가고일",


    //여명
      "킨더",
      "암두시아스",
      "코르투스",


    //황혼
      "베팔",
      "포메쿨",
      "프라이드",


    //악몽
      "자간",
      { name: "커스리퍼", aliases: ["커맆"] },
      "진"

  ]
};

window.DRAGON_ATTR_DB = {
  "땅": ["패트", "타이거", "램곤", "헝그리", "머드", "오렌지리프", "지진", "포이즌리버", "포폰", "애플칙", "알데바란", "에그마용", "파워", "데빌곤", "베가본드", "레오벡터", "바스카", "바위", "지하땅굴", "에그", "리프", "스마트", "타투", "팀버", "플라워", "파키", "히드라곤", "콜로서스", "레이어스", "리베티", "케찰코아틀", "골든혼", "머스타드해머", "칸타카", "아스타테", "헤임달", "논", "파이썬", "헤라클레스", "스파인", "스콜피온", "다로스", "즈믄", "아카이아", "크로마 아카이아"],
  "물": ["네시", "스왐프", "툰드라", "유르카", "알레샤", "크로마 알레샤", "볼바", "빙하고룡", "페어리", "샤크곤", "메갈로돈", "블리자드", "베른하르트", "루드라", "피싱테일", "루미네스", "프로그", "현무", "루피아", "스터드", "위드미", "폴투누스", "스카트", "로키", "블루라이트닝", "바이올렛", "해마곤", "베놈", "브리트라", "프로즌", "루살카", "테일", "수룡", "슬라임", "퍼플립스", "마리노", "나트론", "레굴루스", "크로마 레굴루스", "미니", "아쿠아", "아이스 드레이크", "세크레타", "트로페우스", "마소티스", "옥타", "크로마 옥타"],
  "불": ["붐버", "포포모", "염화룡", "파이거", "크로마 파이거", "파이어", "피닉스", "레드와이번", "말소자", "수라", "엔투라스", "라센티", "배틀", "번네스", "데모니오", "스파이크", "너티빌런", "와일드", "루가르", "토트", "스카투스", "크로마 스카투스", "아이언", "번개고룡", "라바", "본헤드", "플레임", "레드불", "므네이아", "블레이즈", "적마룡", "자룡", "금오", "푸투룸", "이그나", "화귀", "타나토스", "헬", "인섹트", "샌드", "볼케이노", "이그니스", "가루다", "마룡", "불나래", "크로마 불나래"],
  "바람": ["윈드", "식스 레그 혼", "뮤직", "가디언", "토템", "클라우드", "핑크벨", "엠파이어", "혼", "청룡", "페이퍼", "스트라이커", "아스티", "아라카", "거스트", "블루썬더", "크로마 블루썬더", "프로스티", "해태", "스틸윙", "키갈", "리티오", "크로마 리티오", "제트", "스왈로우", "카오스", "제피로스", "보레아스", "레이디", "타이푼", "태엽", "센투라", "티르", "루루", "크로마 루루", "에일리언", "윙스", "메탈 마그넷", "i곤", "피스", "그레이탄", "레인보우배트곤", "에트왈", "피타야", "토르", "오로"],
  "빛": ["카멜레용", "레인보우", "샴", "삐에로", "시타엘", "엔젤주니어", "큐피트", "모리카", "오르도", "솔라", "카루라", "아톤", "스워드", "바르그", "야즈니르", "아르고", "나이트", "순둥곤", "사나래", "로루스", "헤이즈", "개틀링곤", "솔루카니스", "프로텍트", "크로마 프로텍트", "크리마용", "라이곤", "캥거레빗", "네온", "슈팅스타", "깨비곤", "미나스", "알투스", "메라크", "스파이시", "고대신룡", "엔젤", "에메랄드", "치킨헤드", "골드", "백룡", "오로라", "아실리", "스타에이스", "테디", "베르나", "라파엘", "고대 주니어", "파라오곤", "바르라아", "아르테미스", "화이트썬더", "탈릿사", "아만타", "샤흐"],
  "어둠": ["프랑켄", "블랙티어", "원더", "블랙찡또", "문라이트", "말로단", "마그나스", "카스룩스", "블레이드", "서펀트", "G네", "유니", "다크프로스티", "쉐도우", "닌자", "블랙퀸", "스플렌더", "타임머신", "아자크", "베타라", "크로마 베타라", "오벡스", "베네지", "투탕카", "블랙아머", "쿠로이", "카르나", "쿠베라", "포르타", "흑룡", "메탈", "미이라곤", "스켈레곤", "다크닉스", "히에나곤", "크레센트", "윗치", "캣츠곤", "타르타로스", "다크폴", "피데스", "요르문간드", "티아매트", "바알", "시그마", "드라고노이드", "유니버스", "베히모스", "다크나이트", "고트", "뱃도치", "코브라곤", "마르바스", "스케어", "드래곤 슬레이어", "마카라", "리치몬드", "크로마 리치몬드", "하트샤", "데몽과가고일"],
  "여명": ["베리스", "아말테아", "야누스", "합라", "셀마사", "울르", "엘리고스", "라스", "조화룡", "할리벨", "타아비레", "보상이용", "루크바트", "프레이야", "미미르", "네비아", "아프로디테", "킨더", "암두시아스", "코르투스"],
  "황혼": ["이클립스", "템피오스", "흐레스벨그", "카라선", "렉스톤", "틸키", "하리카", "데스락", "세에레", "차차웅", "렉몰 리버스", "네뷸라", "인베르소", "레긴레이프", "크로마 레긴레이프", "발라크", "에피트", "마누스", "베팔", "포메쿨", "프라이드"],
  "악몽": ["단탈리온", "네무스", "블라드", "디멘션", "쉴로시", "잠식된 요르문간드", "레무레스", "벨레드", "미스핏", "크로마 벨레드", "움브라", "루드오어", "크레바스", "발레포르", "크로마 발레포르", "애니마라", "롱기누스", "마스테마", "자간", "커스리퍼", "진"]
};
