const guideList = [
  { id: 1,  title: "드래곤빌리지 용어정리", date: "2026.04.24", tags: ["기타", "기초"] },
  { id: 2,  title: "증명의 탑 공략",  date: "2026.04.24", tags: ["시나리오", "기초"] },
  { id: 3,  title: "이 드래곤 좋은건가요?",  date: "2026.04.24", tags: ["기타", "기초"] },
  { id: 4,  title: "데삭작이란?",  date: "2026.04.24", tags: ["육성", "기초"] },
  { id: 5,  title: "내용 준비중입니다.",  date: "2026.04.24", tags: [] },
  { id: 6,  title: "내용 준비중입니다.",  date: "2026.04.24", tags: [] },
  { id: 7,  title: "내용 준비중입니다.",  date: "2026.04.24", tags: [] },
  { id: 8,  title: "내용 준비중입니다.",  date: "2026.04.24", tags: [] },
  { id: 9,  title: "내용 준비중입니다.",  date: "2026.04.24", tags: [] },
  { id: 10, title: "내용 준비중입니다.", date: "2026.04.24", tags: [] },
];
